#ifndef __LED_RGB_H
#define __LED_RGB_H
/***********************************************************************************************************************************
  *【文件名称】  w25qxx.h
  *【编写人员】  魔女开发板团队
  *【更新分享】  如有更新，分享在Q群文件夹  262901124
  *【淘    宝】  魔女开发板  https://demoboard.taobao.com
  **********************************************************************************************************************************
  *【代码适用】  已于STM32F103xx中验证运行
  *
  *【文件结构】  移植配置：第30行起
  *              常用色值：第40行起
  *              函数声明：第55行起
  *                
  
  *                                                     
  *                 
  *【移植说明】  只需用到一个引脚，在第33行配置即可
  *              
  *              
  *【更新记录】  2020-04-15  创建、完成调试
  *              2021-01-13  完善文件及函数结构、完善注释
  *               
  *
  *
***********************************************************************************************************************************/
#include <stm32f10x.h>  
#include <stdio.h>




/*****************************************************************************
 ** 引脚、端口配置： 移植：需修改下面的配置
*****************************************************************************/
#define  WS2812_GPIO        GPIOC   
#define  WS2812_PIN         GPIO_Pin_13 




/*****************************************************************************
 ** 全局变量： 定义了几种常用的色彩宏定义，方便调用
*****************************************************************************/
#define WS2812_RED       {Ws2812_SetColor(0xFF, 0x00, 0x00);}    // 红
#define WS2812_ORANGE    {Ws2812_SetColor(0xFF, 0xA5, 0x00);}    // 橙
#define WS2812_YELLOW    {Ws2812_SetColor(0xFF, 0xFF, 0x00);}    // 黄
#define WS2812_GREEN     {Ws2812_SetColor(0x00, 0xFF, 0x00);}    // 绿
#define WS2812_CYAN      {Ws2812_SetColor(0x00, 0x80, 0x80);}    // 青
#define WS2812_BLUE      {Ws2812_SetColor(0x00, 0x00, 0xFF);}    // 蓝
#define WS2812_VIOLET    {Ws2812_SetColor(0x80, 0x00, 0x80);}    // 紫
#define WS2812_PINK      {Ws2812_SetColor(0x35, 0x00, 0x10);}    // 粉
 
 
 
  
 
/*****************************************************************************
 ** 声明-全局函数； 移植时不用修改
****************************************************************************/
void Ws2812_Init(void);                           // 初始化ws2812所用引脚
void Ws2812_SetColor(u8 red, u8 green, u8 blue);  // 分别设置色值的红、绿、蓝
void Ws2812_SetRGB(u32 rgb);                      // 设置RGB值, 实际为16位RGB颜色值，声明为u32只为方便日后扩展使用
void Ws2812_Reset(void);                          // 复位
void Ws2812_Off(void);                            // 关闭灯光
#endif




