#ifndef __AT24CXX_H
#define __AT24CXX_H
/***********************************************************************************************************************************
 ** 【购买链接】  魔女开发板    https://demoboard.taobao.com
 ***********************************************************************************************************************************
 **【文件名称】  bsp_24Cxx.h
 **【功能描述】  定义器件地址、全局结构体、声明全局函数
 **
 **【适用平台】  STM32F103 + 标准库v3.5 + keil5
 **                 
 **【移植说明】  引脚修改：在i2c文件中修改，以方便IIC总线复用、代码复用
 **              器件地址：在本文件中修改
 ** 
 **【更新记录】  2020-03-05  创建
 **              2021-05-03  完善文件格式、注释格式
 **
***********************************************************************************************************************************/
#include <stm32f10x.h>  
#include <stdio.h>
#include "bsp_IICSoft.h"



/*****************************************************************************
 * 移植
 * 为配合多个设备共用一个IIC总线, 引脚在i2c.h文件中定义
*****************************************************************************/
#define  AT24Cxx_ADDR    0x50        // 器件的7位地址



/*****************************************************************************
 ** 全局变量
*****************************************************************************/
typedef struct 
{
    uint8_t   initOK;                     // 初始化状态   0:失败, 1:成功
    char type[20];                   // 型号
    u16  startupTimes;               // 记录启动次数
}xAT24Cxx_TypeDef;
extern xAT24Cxx_TypeDef  xAT24Cxx;   // 声明全局变量,方便记录数据

                    
                    
/*****************************************************************************
 ** 声明全局函数
*****************************************************************************/                   
uint8_t  AT24Cxx_Init(void);                                              // 初始化IIC, 并检查器件是否正常

uint8_t  AT24Cxx_ReadByte (uint16_t addr, uint8_t* data);                 // 指定地址读取一个字节
uint8_t  AT24Cxx_WriteByte(uint16_t addr, uint8_t  data);                 // 指定地址写入一个字节
uint8_t  AT24Cxx_WriteBuffer(uint16_t addr, uint8_t* buf, uint16_t num);  // 从指定地址开始写入指定长度的数据
uint8_t  AT24Cxx_ReadBuffer (uint16_t addr, uint8_t* buf, uint16_t num);  // 从指定地址开始读出指定长度的数据


#endif

