#ifndef __PWM_H
#define __PWM_H
/***********************************************************************************************************************************
 **【购买链接】  魔女科技   https://demoboard.taobao.com
 **【更新分享】  Q群文件夹  1126717453
 ***********************************************************************************************************************************
 **【文件名称】  pwm.h
 **【功能描述】  定义引脚、定义全局结构体、声明全局函数
 **【适用平台】  STM32F103 + 标准库v3.5 + keil5
 **                 
 **【移植说明】  引脚修改：在本h文件中修改
 **              TIM参数 ：在本h文件中
 **           
 **【更新记录】  2021-05-16  创建
 **              2021-07-06  完善注释
 **
***********************************************************************************************************************************/
#include <stm32f10x.h>  
#include <stdio.h>
#include "stm32f10x_tim.h"




/*****************************************************************************
 ** 声明全局函数
*****************************************************************************/
void TIM_PwmInit(GPIO_TypeDef* GPIOx, u16 PINx, TIM_TypeDef* TIMx, u8 CHx, u16 PSC, u16 ARR, u16 CCR);  // 引脚端口，引脚编号，TIM端口，TIM通道，72不要改，周期的US数，脉宽的US数
void TIM_SetCCR(TIM_TypeDef* TIMx, u8 CHx, u16 CCR);             // 控制TIMx的CCRx的值;【可选参数】 [TIMx]TIM1~8, [CHx]1~4, [CCR]0~65535;


#endif

